In [1]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv("student.csv")

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

### Sütun İsimlerini Değiştirmek
#### 1. Option

In [8]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [9]:
df.head()

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [10]:
df.columns

Index(['name', 'lastName', 'age', 'number'], dtype='object')

In [11]:
df.columns = ['firstName', 'lastName', 'age', 'number']

In [12]:
df

   firstName lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

#### 2. Option

In [13]:
df

   firstName lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [14]:
df.columns

Index(['firstName', 'lastName', 'age', 'number'], dtype='object')

In [15]:
df.columns = [e.capitalize() for e in df.columns]

In [16]:
df

   Firstname Lastname  Age  Number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

#### Spesifik Sütunun Adını Değiştirmek
* Hangi sütun ismi değiştirilecekse, dictionary formatında verip spesifik olarak değiştirebiliriz

In [17]:
df

   Firstname Lastname  Age  Number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

In [22]:
new_col = {"Firstname":"first", "Age":"student_age"}

In [23]:
df.rename(columns=new_col)

       first Lastname  student_age  Number
0    Alperen  Kolamuc           18     401
1  Cristiano  Ronaldo           35     303
2      Sinan    Engin           48     105
3      Fırat  Aydınus           42     216